In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [2]:
data = []
#df = pd.DataFrame({'A' : []})
with open('movie_titles.txt') as f:
    content = f.readlines()
    for i in content:
        data.append(i[:-1].split(','))
        #print(i)

In [3]:
D=pd.DataFrame(data,columns=['Movie ID','Year of release','Title','A','B','C'])

In [4]:
len(D)

17770

In [5]:
D=D.dropna(axis='columns')

In [6]:
D.head()

  Movie ID Year of release                         Title
0        1            2003               Dinosaur Planet
1        2            2004    Isle of Man TT 2004 Review
2        3            1997                     Character
3        4            1994  Paula Abdul's Get Up & Dance
4        5            2004      The Rise and Fall of ECW

In [9]:
read_file = pd.read_csv (r'C:\Users\admin\Desktop\Data Visualization\Netflix dataset\combined_data_1.txt',header = None, names = ['Cust_Id', 'Rating'], usecols = [0,1])

In [10]:
read_file['Rating'] = read_file['Rating'].astype(float)

In [12]:
df1=read_file.head()

In [13]:
df1.head()

   Cust_Id  Rating
0       1:     NaN
1  1488844     3.0
2   822109     5.0
3   885013     4.0
4    30878     4.0

In [14]:
df2 = pd.read_csv (r'C:\Users\admin\Desktop\Data Visualization\Netflix dataset\combined_data_2.txt',header = None, names = ['Cust_Id', 'Rating'], usecols = [0,1])

In [15]:
df2.head()

   Cust_Id  Rating
0    4500:     NaN
1  2532865     4.0
2   573364     3.0
3  1696725     3.0
4  1253431     3.0

In [16]:
df3 = pd.read_csv (r'C:\Users\admin\Desktop\Data Visualization\Netflix dataset\combined_data_3.txt',header = None, names = ['Cust_Id', 'Rating'], usecols = [0,1])

In [17]:
df3.head()

   Cust_Id  Rating
0    9211:     NaN
1  1277134     1.0
2  2435457     2.0
3  2338545     3.0
4  2218269     1.0

In [18]:
df4 = pd.read_csv (r'C:\Users\admin\Desktop\Data Visualization\Netflix dataset\combined_data_4.txt',header = None, names = ['Cust_Id', 'Rating'], usecols = [0,1])

In [19]:
df4.head()

   Cust_Id  Rating
0   13368:     NaN
1  2385003     4.0
2   659432     3.0
3   751812     2.0
4  2625420     2.0

In [20]:
df = df1
df = df1.append(df2)
df = df.append(df3)
df = df.append(df4)

In [ ]:
df.head()